distillQwen8b/sglang_local_8rq_40G.txt
Namespace(backend='sglang', base_url='https://sglang01.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=40960, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=8.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
============ Serving Benchmark Result ============
Successful requests:                     40944     
Benchmark duration (s):                  5194.90   
Total input tokens:                      9099077   
Total generated tokens:                  7865836   
Request throughput (req/s):              7.88      
Input token throughput (tok/s):          1751.54   
Output token throughput (tok/s):         1514.15   
---------------Time to First Token----------------
Mean TTFT (ms):                          250.41    
Median TTFT (ms):                        244.84    
P99 TTFT (ms):                           527.84    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          136.84    
Median TPOT (ms):                        146.02    
P99 TPOT (ms):                           226.01    
---------------Inter-token Latency----------------
Mean ITL (ms):                           135.18    
Median ITL (ms):                         96.91     
P99 ITL (ms):                            536.06    
==================================================